nxp-mcuxpresso/mcux-soc-svd/LPC5528/LPC5528.xml
        <register>
          <name>XTAL32K</name>
          <description>32 KHz Crystal oscillator (XTAL) control register [Reset by: PoR, Brown Out Detectors Reset]</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x204052</resetValue>
          <resetMask>0x3FFFFFE</resetMask>
          <fields>
            <field>
              <name>IREF</name>
              <description>reference output current selection inputs.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST</name>
              <description>Oscillator Test Mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIAS</name>
              <description>bias current selection inputs.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMPL</name>
              <description>oscillator amplitude selection inputs.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPBANKIN</name>
              <description>Capa bank setting input.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPBANKOUT</name>
              <description>Capa bank setting output.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTESTSTARTSRCSEL</name>
              <description>Source selection for xo32k_captest_start_ao_set.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPSTART</name>
                  <description>Sourced from CAPTESTSTART.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CALIB</name>
                  <description>Sourced from calibration.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTESTSTART</name>
              <description>Start test.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTESTENABLE</name>
              <description>Enable signal for cap test.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTESTOSCINSEL</name>
              <description>Select the input for test.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSCOUT</name>
                  <description>Oscillator output pin (osc_out).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCIN</name>
                  <description>Oscillator input pin (osc_in).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP</name>
          <description>Analog Comparator control register [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset]</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA</resetValue>
          <resetMask>0xFF7FFE</resetMask>
          <fields>
            <field>
              <name>HYST</name>
              <description>Hysteris when hyst = '1'.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Hysteresis is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Hysteresis is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREFINPUT</name>
              <description>Dedicated control bit to select between internal VREF and VDDA (for the resistive ladder).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERNALREF</name>
                  <description>Select internal VREF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDA</name>
                  <description>Select VDDA.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOWPOWER</name>
              <description>Low power mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGHSPEED</name>
                  <description>High speed mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWSPEED</name>
                  <description>Low power mode (Low speed).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMUX</name>
              <description>Control word for P multiplexer:.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREF</name>
                  <description>VREF (See fiedl VREFINPUT).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_A</name>
                  <description>Pin P0_0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_B</name>
                  <description>Pin P0_9.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_C</name>
                  <description>Pin P0_18.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_D</name>
                  <description>Pin P1_14.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_E</name>
                  <description>Pin P2_23.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NMUX</name>
              <description>Control word for N multiplexer:.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREF</name>
                  <description>VREF (See field VREFINPUT).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_A</name>
                  <description>Pin P0_0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_B</name>
                  <description>Pin P0_9.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_C</name>
                  <description>Pin P0_18.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_D</name>
                  <description>Pin P1_14.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_E</name>
                  <description>Pin P2_23.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREF</name>
              <description>Control reference voltage step, per steps of (VREFINPUT/31).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTERCGF_SAMPLEMODE</name>
              <description>Control the filtering of the Analog Comparator output.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>Bypass mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER1CLK</name>
                  <description>Filter 1 clock period.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER2CLK</name>
                  <description>Filter 2 clock period.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER3CLK</name>
                  <description>Filter 3 clock period.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTERCGF_CLKDIV</name>
              <description>Filter Clock divider.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FILTER_1CLK_PERIOD</name>
                  <description>Filter clock period duration equals 1 Analog Comparator clock period.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_2CLK_PERIOD</name>
                  <description>Filter clock period duration equals 2 Analog Comparator clock period.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_4CLK_PERIOD</name>
                  <description>Filter clock period duration equals 4 Analog Comparator clock period.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_8CLK_PERIOD</name>
                  <description>Filter clock period duration equals 8 Analog Comparator clock period.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_16CLK_PERIOD</name>
                  <description>Filter clock period duration equals 16 Analog Comparator clock period.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_32CLK_PERIOD</name>
                  <description>Filter clock period duration equals 32 Analog Comparator clock period.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_64CLK_PERIOD</name>
                  <description>Filter clock period duration equals 64 Analog Comparator clock period.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_128CLK_PERIOD</name>
                  <description>Filter clock period duration equals 128 Analog Comparator clock period.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEUPIOCTRL</name>
          <description>Deep Power Down wake-up source [Reset by: PoR, Pin Reset, Software Reset]</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>RISINGEDGEWAKEUP0</name>
              <description>Enable / disable detection of rising edge events on Wake Up 0 pin in Deep Power Down modes:.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Rising edge detection is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Rising edge detection is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FALLINGEDGEWAKEUP0</name>
              <description>Enable / disable detection of falling edge events on Wake Up 0 pin in Deep Power Down modes:.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Falling edge detection is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Falling edge detection is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RISINGEDGEWAKEUP1</name>
              <description>Enable / disable detection of rising edge events on Wake Up 1 pin in Deep Power Down modes:.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Rising edge detection is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Rising edge detection is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FALLINGEDGEWAKEUP1</name>
              <description>Enable / disable detection of falling edge events on Wake Up 1 pin in Deep Power Down modes:.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Falling edge detection is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Falling edge detection is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RISINGEDGEWAKEUP2</name>
              <description>Enable / disable detection of rising edge events on Wake Up 2 pin in Deep Power Down modes:.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Rising edge detection is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Rising edge detection is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FALLINGEDGEWAKEUP2</name>
              <description>Enable / disable detection of falling edge events on Wake Up 2 pin in Deep Power Down modes:.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Falling edge detection is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Falling edge detection is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RISINGEDGEWAKEUP3</name>
              <description>Enable / disable detection of rising edge events on Wake Up 3 pin in Deep Power Down modes:.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Rising edge detection is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Rising edge detection is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FALLINGEDGEWAKEUP3</name>
              <description>Enable / disable detection of falling edge events on Wake Up 3 pin in Deep Power Down modes:.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Falling edge detection is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Falling edge detection is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODEWAKEUP0</name>
              <description>Configure wake up I/O 0 in Deep Power Down mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEWAKEUP1</name>
              <description>Configure wake up I/O 1 in Deep Power Down mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEWAKEUP2</name>
              <description>Configure wake up I/O 2 in Deep Power Down mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEWAKEUP3</name>
              <description>Configure wake up I/O 3 in Deep Power Down mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
