nxp-mcuxpresso/mcux-soc-svd/LPC5528/LPC5528.xml
        <register>
          <name>SEC_CPU_INT_MASK1</name>
          <description>Secure Interrupt mask for CPU1</description>
          <addressOffset>0xF94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_INT0_IRQ4</name>
              <description>Pin interrupt 4 or pattern match engine slice 4 interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO_INT0_IRQ5</name>
              <description>Pin interrupt 5 or pattern match engine slice 5 interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO_INT0_IRQ6</name>
              <description>Pin interrupt 6 or pattern match engine slice 6 interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO_INT0_IRQ7</name>
              <description>Pin interrupt 7 or pattern match engine slice 7 interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTIMER2_IRQ</name>
              <description>Standard counter/timer 2 interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTIMER4_IRQ</name>
              <description>Standard counter/timer 4 interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OS_EVENT_TIMER_IRQ</name>
              <description>OS Event Timer and OS Event Timer Wakeup interrupts</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>Reserved. Read value is undefined, only zero should be written.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Reserved. Read value is undefined, only zero should be written.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Reserved. Read value is undefined, only zero should be written.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDIO_IRQ</name>
              <description>SDIO Controller interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>Reserved. Read value is undefined, only zero should be written.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>Reserved. Read value is undefined, only zero should be written.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED5</name>
              <description>Reserved. Read value is undefined, only zero should be written.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB1_PHY_IRQ</name>
              <description>USB High Speed PHY Controller interrupt.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB1_IRQ</name>
              <description>USB High Speed Controller interrupt.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB1_NEEDCLK</name>
              <description>USB High Speed Controller Clock request interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_HYPERVISOR_CALL_IRQ</name>
              <description>Secure fault Hyper Visor call interrupt.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_GPIO_INT0_IRQ0</name>
              <description>Secure Pin interrupt 0 or pattern match engine slice 0 interrupt.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_GPIO_INT0_IRQ1</name>
              <description>Secure Pin interrupt 1 or pattern match engine slice 1 interrupt.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLU_IRQ</name>
              <description>Programmable Look-Up Controller interrupt.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_VIO_IRQ</name>
              <description>Security Violation interrupt.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHA_IRQ</name>
              <description>HASH-AES interrupt.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CASPER_IRQ</name>
              <description>CASPER interrupt.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUFKEY_IRQ</name>
              <description>PUF interrupt.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PQ_IRQ</name>
              <description>Power Quad interrupt.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDMA1_IRQ</name>
              <description>System DMA 1 (Secure) interrupt</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSPI_HS_IRQ</name>
              <description>High Speed SPI interrupt</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVISIBLE</name>
                  <description>Interrupt is blocked to CPU1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VISIBLE</name>
                  <description>Interrupt is readable by CPU1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
